zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name I2S0_I_BCK
 * @{
 */
#define I2S0_I_BCK_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO24 ESP32_PINMUX(24, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO28 ESP32_PINMUX(28, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO30 ESP32_PINMUX(30, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO31 ESP32_PINMUX(31, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO40 ESP32_PINMUX(40, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO42 ESP32_PINMUX(42, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO43 ESP32_PINMUX(43, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO44 ESP32_PINMUX(44, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO45 ESP32_PINMUX(45, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO46 ESP32_PINMUX(46, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO47 ESP32_PINMUX(47, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO48 ESP32_PINMUX(48, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO49 ESP32_PINMUX(49, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO50 ESP32_PINMUX(50, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO51 ESP32_PINMUX(51, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO52 ESP32_PINMUX(52, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO53 ESP32_PINMUX(53, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO54 ESP32_PINMUX(54, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO55 ESP32_PINMUX(55, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO56 ESP32_PINMUX(56, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO57 ESP32_PINMUX(57, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO58 ESP32_PINMUX(58, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO59 ESP32_PINMUX(59, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO60 ESP32_PINMUX(60, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
#define I2S0_I_BCK_GPIO61 ESP32_PINMUX(61, ESP_I2S0I_BCK_IN, ESP_I2S0I_BCK_OUT)
/** @} */

/**
 * @name I2S0_I_SD
 * @{
 */
#define I2S0_I_SD_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO24 ESP32_PINMUX(24, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO28 ESP32_PINMUX(28, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO30 ESP32_PINMUX(30, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO31 ESP32_PINMUX(31, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO40 ESP32_PINMUX(40, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO42 ESP32_PINMUX(42, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO43 ESP32_PINMUX(43, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO44 ESP32_PINMUX(44, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO45 ESP32_PINMUX(45, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO46 ESP32_PINMUX(46, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO47 ESP32_PINMUX(47, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO48 ESP32_PINMUX(48, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO49 ESP32_PINMUX(49, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO50 ESP32_PINMUX(50, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO51 ESP32_PINMUX(51, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO52 ESP32_PINMUX(52, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO53 ESP32_PINMUX(53, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO54 ESP32_PINMUX(54, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO55 ESP32_PINMUX(55, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO56 ESP32_PINMUX(56, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO57 ESP32_PINMUX(57, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO58 ESP32_PINMUX(58, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO59 ESP32_PINMUX(59, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO60 ESP32_PINMUX(60, ESP_I2S0I_SD_IN, ESP_NOSIG)
#define I2S0_I_SD_GPIO61 ESP32_PINMUX(61, ESP_I2S0I_SD_IN, ESP_NOSIG)
/** @} */

/**
 * @name I2S0_I_SD1
 * @{
 */
#define I2S0_I_SD1_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO24 ESP32_PINMUX(24, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO28 ESP32_PINMUX(28, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO30 ESP32_PINMUX(30, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO31 ESP32_PINMUX(31, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO40 ESP32_PINMUX(40, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO42 ESP32_PINMUX(42, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO43 ESP32_PINMUX(43, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO44 ESP32_PINMUX(44, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO45 ESP32_PINMUX(45, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO46 ESP32_PINMUX(46, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO47 ESP32_PINMUX(47, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO48 ESP32_PINMUX(48, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO49 ESP32_PINMUX(49, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO50 ESP32_PINMUX(50, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO51 ESP32_PINMUX(51, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO52 ESP32_PINMUX(52, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO53 ESP32_PINMUX(53, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO54 ESP32_PINMUX(54, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO55 ESP32_PINMUX(55, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO56 ESP32_PINMUX(56, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO57 ESP32_PINMUX(57, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO58 ESP32_PINMUX(58, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO59 ESP32_PINMUX(59, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO60 ESP32_PINMUX(60, ESP_I2S0I_SD1_IN, ESP_NOSIG)
#define I2S0_I_SD1_GPIO61 ESP32_PINMUX(61, ESP_I2S0I_SD1_IN, ESP_NOSIG)
/** @} */

/**
 * @name I2S0_I_SD2
 * @{
 */
#define I2S0_I_SD2_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO24 ESP32_PINMUX(24, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO28 ESP32_PINMUX(28, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO30 ESP32_PINMUX(30, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO31 ESP32_PINMUX(31, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO40 ESP32_PINMUX(40, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO42 ESP32_PINMUX(42, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO43 ESP32_PINMUX(43, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO44 ESP32_PINMUX(44, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO45 ESP32_PINMUX(45, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO46 ESP32_PINMUX(46, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO47 ESP32_PINMUX(47, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO48 ESP32_PINMUX(48, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO49 ESP32_PINMUX(49, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO50 ESP32_PINMUX(50, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO51 ESP32_PINMUX(51, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO52 ESP32_PINMUX(52, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO53 ESP32_PINMUX(53, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO54 ESP32_PINMUX(54, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO55 ESP32_PINMUX(55, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO56 ESP32_PINMUX(56, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO57 ESP32_PINMUX(57, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO58 ESP32_PINMUX(58, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO59 ESP32_PINMUX(59, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO60 ESP32_PINMUX(60, ESP_I2S0I_SD2_IN, ESP_NOSIG)
#define I2S0_I_SD2_GPIO61 ESP32_PINMUX(61, ESP_I2S0I_SD2_IN, ESP_NOSIG)
/** @} */

/**
 * @name I2S0_I_SD3
 * @{
 */
#define I2S0_I_SD3_GPIO0 ESP32_PINMUX(0, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO1 ESP32_PINMUX(1, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO2 ESP32_PINMUX(2, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO3 ESP32_PINMUX(3, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO4 ESP32_PINMUX(4, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO5 ESP32_PINMUX(5, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO6 ESP32_PINMUX(6, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO7 ESP32_PINMUX(7, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO8 ESP32_PINMUX(8, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO9 ESP32_PINMUX(9, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO10 ESP32_PINMUX(10, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO11 ESP32_PINMUX(11, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO12 ESP32_PINMUX(12, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO13 ESP32_PINMUX(13, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO14 ESP32_PINMUX(14, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO15 ESP32_PINMUX(15, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO16 ESP32_PINMUX(16, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO17 ESP32_PINMUX(17, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO18 ESP32_PINMUX(18, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO19 ESP32_PINMUX(19, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO20 ESP32_PINMUX(20, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO21 ESP32_PINMUX(21, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO22 ESP32_PINMUX(22, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO23 ESP32_PINMUX(23, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO24 ESP32_PINMUX(24, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO25 ESP32_PINMUX(25, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO26 ESP32_PINMUX(26, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO27 ESP32_PINMUX(27, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO28 ESP32_PINMUX(28, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO30 ESP32_PINMUX(30, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO31 ESP32_PINMUX(31, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO32 ESP32_PINMUX(32, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO33 ESP32_PINMUX(33, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO34 ESP32_PINMUX(34, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO35 ESP32_PINMUX(35, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO36 ESP32_PINMUX(36, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO37 ESP32_PINMUX(37, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO38 ESP32_PINMUX(38, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO39 ESP32_PINMUX(39, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO40 ESP32_PINMUX(40, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO42 ESP32_PINMUX(42, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO43 ESP32_PINMUX(43, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO44 ESP32_PINMUX(44, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO45 ESP32_PINMUX(45, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO46 ESP32_PINMUX(46, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO47 ESP32_PINMUX(47, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO48 ESP32_PINMUX(48, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO49 ESP32_PINMUX(49, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO50 ESP32_PINMUX(50, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO51 ESP32_PINMUX(51, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO52 ESP32_PINMUX(52, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO53 ESP32_PINMUX(53, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO54 ESP32_PINMUX(54, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO55 ESP32_PINMUX(55, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO56 ESP32_PINMUX(56, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO57 ESP32_PINMUX(57, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO58 ESP32_PINMUX(58, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO59 ESP32_PINMUX(59, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO60 ESP32_PINMUX(60, ESP_I2S0I_SD3_IN, ESP_NOSIG)
#define I2S0_I_SD3_GPIO61 ESP32_PINMUX(61, ESP_I2S0I_SD3_IN, ESP_NOSIG)
/** @} */

