zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name LEDC_CH7
 * @{
 */
#define LEDC_CH7_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
#define LEDC_CH7_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC_LS_SIG_OUT7)
/** @} */

/**
 * @name LEDC1_CH0
 * @{
 */
#define LEDC1_CH0_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
#define LEDC1_CH0_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT0)
/** @} */

/**
 * @name LEDC1_CH1
 * @{
 */
#define LEDC1_CH1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
#define LEDC1_CH1_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT1)
/** @} */

/**
 * @name LEDC1_CH2
 * @{
 */
#define LEDC1_CH2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
#define LEDC1_CH2_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT2)
/** @} */

/**
 * @name LEDC1_CH3
 * @{
 */
#define LEDC1_CH3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
#define LEDC1_CH3_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT3)
/** @} */

