zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name LEDC1_CH4
 * @{
 */
#define LEDC1_CH4_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
#define LEDC1_CH4_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT4)
/** @} */

/**
 * @name LEDC1_CH5
 * @{
 */
#define LEDC1_CH5_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
#define LEDC1_CH5_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT5)
/** @} */

/**
 * @name LEDC1_CH6
 * @{
 */
#define LEDC1_CH6_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
#define LEDC1_CH6_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT6)
/** @} */

/**
 * @name LEDC1_CH7
 * @{
 */
#define LEDC1_CH7_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
#define LEDC1_CH7_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_LEDC1_LS_SIG_OUT7)
/** @} */

/**
 * @name MCPWM0_CAP0
 * @{
 */
#define MCPWM0_CAP0_GPIO0 ESP32_PINMUX(0, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO1 ESP32_PINMUX(1, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO2 ESP32_PINMUX(2, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO3 ESP32_PINMUX(3, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO4 ESP32_PINMUX(4, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO5 ESP32_PINMUX(5, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO6 ESP32_PINMUX(6, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO7 ESP32_PINMUX(7, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO8 ESP32_PINMUX(8, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO9 ESP32_PINMUX(9, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO10 ESP32_PINMUX(10, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO11 ESP32_PINMUX(11, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO12 ESP32_PINMUX(12, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO13 ESP32_PINMUX(13, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO14 ESP32_PINMUX(14, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO15 ESP32_PINMUX(15, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO16 ESP32_PINMUX(16, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO17 ESP32_PINMUX(17, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO18 ESP32_PINMUX(18, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO19 ESP32_PINMUX(19, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO20 ESP32_PINMUX(20, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO21 ESP32_PINMUX(21, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO22 ESP32_PINMUX(22, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO23 ESP32_PINMUX(23, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO24 ESP32_PINMUX(24, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO25 ESP32_PINMUX(25, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO26 ESP32_PINMUX(26, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO27 ESP32_PINMUX(27, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO28 ESP32_PINMUX(28, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO30 ESP32_PINMUX(30, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO31 ESP32_PINMUX(31, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO32 ESP32_PINMUX(32, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO33 ESP32_PINMUX(33, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO34 ESP32_PINMUX(34, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO35 ESP32_PINMUX(35, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO36 ESP32_PINMUX(36, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO37 ESP32_PINMUX(37, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO38 ESP32_PINMUX(38, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO39 ESP32_PINMUX(39, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO40 ESP32_PINMUX(40, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO42 ESP32_PINMUX(42, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO43 ESP32_PINMUX(43, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO44 ESP32_PINMUX(44, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO45 ESP32_PINMUX(45, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO46 ESP32_PINMUX(46, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO47 ESP32_PINMUX(47, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO48 ESP32_PINMUX(48, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO49 ESP32_PINMUX(49, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO50 ESP32_PINMUX(50, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO51 ESP32_PINMUX(51, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO52 ESP32_PINMUX(52, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO53 ESP32_PINMUX(53, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO54 ESP32_PINMUX(54, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO55 ESP32_PINMUX(55, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO56 ESP32_PINMUX(56, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO57 ESP32_PINMUX(57, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO58 ESP32_PINMUX(58, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO59 ESP32_PINMUX(59, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO60 ESP32_PINMUX(60, ESP_PWM0_CAP0_IN, ESP_NOSIG)
#define MCPWM0_CAP0_GPIO61 ESP32_PINMUX(61, ESP_PWM0_CAP0_IN, ESP_NOSIG)
/** @} */

