zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name MCPWM1_CAP1
 * @{
 */
#define MCPWM1_CAP1_GPIO0 ESP32_PINMUX(0, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO1 ESP32_PINMUX(1, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO2 ESP32_PINMUX(2, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO3 ESP32_PINMUX(3, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO4 ESP32_PINMUX(4, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO5 ESP32_PINMUX(5, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO6 ESP32_PINMUX(6, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO7 ESP32_PINMUX(7, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO8 ESP32_PINMUX(8, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO9 ESP32_PINMUX(9, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO10 ESP32_PINMUX(10, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO11 ESP32_PINMUX(11, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO12 ESP32_PINMUX(12, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO13 ESP32_PINMUX(13, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO14 ESP32_PINMUX(14, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO15 ESP32_PINMUX(15, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO16 ESP32_PINMUX(16, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO17 ESP32_PINMUX(17, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO18 ESP32_PINMUX(18, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO19 ESP32_PINMUX(19, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO20 ESP32_PINMUX(20, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO21 ESP32_PINMUX(21, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO22 ESP32_PINMUX(22, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO23 ESP32_PINMUX(23, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO24 ESP32_PINMUX(24, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO25 ESP32_PINMUX(25, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO26 ESP32_PINMUX(26, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO27 ESP32_PINMUX(27, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO28 ESP32_PINMUX(28, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO30 ESP32_PINMUX(30, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO31 ESP32_PINMUX(31, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO32 ESP32_PINMUX(32, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO33 ESP32_PINMUX(33, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO34 ESP32_PINMUX(34, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO35 ESP32_PINMUX(35, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO36 ESP32_PINMUX(36, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO37 ESP32_PINMUX(37, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO38 ESP32_PINMUX(38, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO39 ESP32_PINMUX(39, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO40 ESP32_PINMUX(40, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO42 ESP32_PINMUX(42, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO43 ESP32_PINMUX(43, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO44 ESP32_PINMUX(44, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO45 ESP32_PINMUX(45, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO46 ESP32_PINMUX(46, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO47 ESP32_PINMUX(47, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO48 ESP32_PINMUX(48, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO49 ESP32_PINMUX(49, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO50 ESP32_PINMUX(50, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO51 ESP32_PINMUX(51, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO52 ESP32_PINMUX(52, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO53 ESP32_PINMUX(53, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO54 ESP32_PINMUX(54, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO55 ESP32_PINMUX(55, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO56 ESP32_PINMUX(56, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO57 ESP32_PINMUX(57, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO58 ESP32_PINMUX(58, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO59 ESP32_PINMUX(59, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO60 ESP32_PINMUX(60, ESP_PWM1_CAP1_IN, ESP_NOSIG)
#define MCPWM1_CAP1_GPIO61 ESP32_PINMUX(61, ESP_PWM1_CAP1_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_CAP2
 * @{
 */
#define MCPWM1_CAP2_GPIO0 ESP32_PINMUX(0, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO1 ESP32_PINMUX(1, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO2 ESP32_PINMUX(2, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO3 ESP32_PINMUX(3, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO4 ESP32_PINMUX(4, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO5 ESP32_PINMUX(5, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO6 ESP32_PINMUX(6, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO7 ESP32_PINMUX(7, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO8 ESP32_PINMUX(8, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO9 ESP32_PINMUX(9, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO10 ESP32_PINMUX(10, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO11 ESP32_PINMUX(11, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO12 ESP32_PINMUX(12, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO13 ESP32_PINMUX(13, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO14 ESP32_PINMUX(14, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO15 ESP32_PINMUX(15, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO16 ESP32_PINMUX(16, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO17 ESP32_PINMUX(17, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO18 ESP32_PINMUX(18, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO19 ESP32_PINMUX(19, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO20 ESP32_PINMUX(20, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO21 ESP32_PINMUX(21, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO22 ESP32_PINMUX(22, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO23 ESP32_PINMUX(23, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO24 ESP32_PINMUX(24, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO25 ESP32_PINMUX(25, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO26 ESP32_PINMUX(26, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO27 ESP32_PINMUX(27, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO28 ESP32_PINMUX(28, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO30 ESP32_PINMUX(30, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO31 ESP32_PINMUX(31, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO32 ESP32_PINMUX(32, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO33 ESP32_PINMUX(33, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO34 ESP32_PINMUX(34, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO35 ESP32_PINMUX(35, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO36 ESP32_PINMUX(36, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO37 ESP32_PINMUX(37, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO38 ESP32_PINMUX(38, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO39 ESP32_PINMUX(39, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO40 ESP32_PINMUX(40, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO42 ESP32_PINMUX(42, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO43 ESP32_PINMUX(43, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO44 ESP32_PINMUX(44, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO45 ESP32_PINMUX(45, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO46 ESP32_PINMUX(46, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO47 ESP32_PINMUX(47, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO48 ESP32_PINMUX(48, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO49 ESP32_PINMUX(49, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO50 ESP32_PINMUX(50, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO51 ESP32_PINMUX(51, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO52 ESP32_PINMUX(52, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO53 ESP32_PINMUX(53, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO54 ESP32_PINMUX(54, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO55 ESP32_PINMUX(55, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO56 ESP32_PINMUX(56, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO57 ESP32_PINMUX(57, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO58 ESP32_PINMUX(58, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO59 ESP32_PINMUX(59, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO60 ESP32_PINMUX(60, ESP_PWM1_CAP2_IN, ESP_NOSIG)
#define MCPWM1_CAP2_GPIO61 ESP32_PINMUX(61, ESP_PWM1_CAP2_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_FAULT0
 * @{
 */
#define MCPWM1_FAULT0_GPIO0 ESP32_PINMUX(0, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO1 ESP32_PINMUX(1, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO2 ESP32_PINMUX(2, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO3 ESP32_PINMUX(3, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO4 ESP32_PINMUX(4, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO5 ESP32_PINMUX(5, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO6 ESP32_PINMUX(6, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO7 ESP32_PINMUX(7, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO8 ESP32_PINMUX(8, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO9 ESP32_PINMUX(9, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO10 ESP32_PINMUX(10, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO11 ESP32_PINMUX(11, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO12 ESP32_PINMUX(12, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO13 ESP32_PINMUX(13, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO14 ESP32_PINMUX(14, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO15 ESP32_PINMUX(15, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO16 ESP32_PINMUX(16, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO17 ESP32_PINMUX(17, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO18 ESP32_PINMUX(18, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO19 ESP32_PINMUX(19, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO20 ESP32_PINMUX(20, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO21 ESP32_PINMUX(21, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO22 ESP32_PINMUX(22, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO23 ESP32_PINMUX(23, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO24 ESP32_PINMUX(24, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO25 ESP32_PINMUX(25, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO26 ESP32_PINMUX(26, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO27 ESP32_PINMUX(27, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO28 ESP32_PINMUX(28, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO30 ESP32_PINMUX(30, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO31 ESP32_PINMUX(31, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO32 ESP32_PINMUX(32, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO33 ESP32_PINMUX(33, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO34 ESP32_PINMUX(34, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO35 ESP32_PINMUX(35, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO36 ESP32_PINMUX(36, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO37 ESP32_PINMUX(37, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO38 ESP32_PINMUX(38, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO39 ESP32_PINMUX(39, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO40 ESP32_PINMUX(40, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO42 ESP32_PINMUX(42, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO43 ESP32_PINMUX(43, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO44 ESP32_PINMUX(44, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO45 ESP32_PINMUX(45, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO46 ESP32_PINMUX(46, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO47 ESP32_PINMUX(47, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO48 ESP32_PINMUX(48, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO49 ESP32_PINMUX(49, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO50 ESP32_PINMUX(50, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO51 ESP32_PINMUX(51, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO52 ESP32_PINMUX(52, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO53 ESP32_PINMUX(53, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO54 ESP32_PINMUX(54, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO55 ESP32_PINMUX(55, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO56 ESP32_PINMUX(56, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO57 ESP32_PINMUX(57, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO58 ESP32_PINMUX(58, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO59 ESP32_PINMUX(59, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO60 ESP32_PINMUX(60, ESP_PWM1_F0_IN, ESP_NOSIG)
#define MCPWM1_FAULT0_GPIO61 ESP32_PINMUX(61, ESP_PWM1_F0_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_FAULT1
 * @{
 */
#define MCPWM1_FAULT1_GPIO0 ESP32_PINMUX(0, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO1 ESP32_PINMUX(1, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO2 ESP32_PINMUX(2, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO3 ESP32_PINMUX(3, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO4 ESP32_PINMUX(4, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO5 ESP32_PINMUX(5, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO6 ESP32_PINMUX(6, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO7 ESP32_PINMUX(7, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO8 ESP32_PINMUX(8, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO9 ESP32_PINMUX(9, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO10 ESP32_PINMUX(10, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO11 ESP32_PINMUX(11, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO12 ESP32_PINMUX(12, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO13 ESP32_PINMUX(13, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO14 ESP32_PINMUX(14, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO15 ESP32_PINMUX(15, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO16 ESP32_PINMUX(16, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO17 ESP32_PINMUX(17, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO18 ESP32_PINMUX(18, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO19 ESP32_PINMUX(19, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO20 ESP32_PINMUX(20, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO21 ESP32_PINMUX(21, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO22 ESP32_PINMUX(22, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO23 ESP32_PINMUX(23, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO24 ESP32_PINMUX(24, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO25 ESP32_PINMUX(25, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO26 ESP32_PINMUX(26, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO27 ESP32_PINMUX(27, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO28 ESP32_PINMUX(28, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO30 ESP32_PINMUX(30, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO31 ESP32_PINMUX(31, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO32 ESP32_PINMUX(32, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO33 ESP32_PINMUX(33, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO34 ESP32_PINMUX(34, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO35 ESP32_PINMUX(35, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO36 ESP32_PINMUX(36, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO37 ESP32_PINMUX(37, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO38 ESP32_PINMUX(38, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO39 ESP32_PINMUX(39, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO40 ESP32_PINMUX(40, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO42 ESP32_PINMUX(42, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO43 ESP32_PINMUX(43, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO44 ESP32_PINMUX(44, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO45 ESP32_PINMUX(45, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO46 ESP32_PINMUX(46, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO47 ESP32_PINMUX(47, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO48 ESP32_PINMUX(48, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO49 ESP32_PINMUX(49, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO50 ESP32_PINMUX(50, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO51 ESP32_PINMUX(51, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO52 ESP32_PINMUX(52, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO53 ESP32_PINMUX(53, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO54 ESP32_PINMUX(54, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO55 ESP32_PINMUX(55, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO56 ESP32_PINMUX(56, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO57 ESP32_PINMUX(57, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO58 ESP32_PINMUX(58, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO59 ESP32_PINMUX(59, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO60 ESP32_PINMUX(60, ESP_PWM1_F1_IN, ESP_NOSIG)
#define MCPWM1_FAULT1_GPIO61 ESP32_PINMUX(61, ESP_PWM1_F1_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_FAULT2
 * @{
 */
#define MCPWM1_FAULT2_GPIO0 ESP32_PINMUX(0, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO1 ESP32_PINMUX(1, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO2 ESP32_PINMUX(2, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO3 ESP32_PINMUX(3, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO4 ESP32_PINMUX(4, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO5 ESP32_PINMUX(5, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO6 ESP32_PINMUX(6, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO7 ESP32_PINMUX(7, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO8 ESP32_PINMUX(8, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO9 ESP32_PINMUX(9, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO10 ESP32_PINMUX(10, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO11 ESP32_PINMUX(11, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO12 ESP32_PINMUX(12, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO13 ESP32_PINMUX(13, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO14 ESP32_PINMUX(14, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO15 ESP32_PINMUX(15, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO16 ESP32_PINMUX(16, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO17 ESP32_PINMUX(17, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO18 ESP32_PINMUX(18, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO19 ESP32_PINMUX(19, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO20 ESP32_PINMUX(20, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO21 ESP32_PINMUX(21, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO22 ESP32_PINMUX(22, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO23 ESP32_PINMUX(23, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO24 ESP32_PINMUX(24, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO25 ESP32_PINMUX(25, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO26 ESP32_PINMUX(26, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO27 ESP32_PINMUX(27, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO28 ESP32_PINMUX(28, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO30 ESP32_PINMUX(30, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO31 ESP32_PINMUX(31, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO32 ESP32_PINMUX(32, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO33 ESP32_PINMUX(33, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO34 ESP32_PINMUX(34, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO35 ESP32_PINMUX(35, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO36 ESP32_PINMUX(36, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO37 ESP32_PINMUX(37, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO38 ESP32_PINMUX(38, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO39 ESP32_PINMUX(39, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO40 ESP32_PINMUX(40, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO42 ESP32_PINMUX(42, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO43 ESP32_PINMUX(43, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO44 ESP32_PINMUX(44, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO45 ESP32_PINMUX(45, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO46 ESP32_PINMUX(46, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO47 ESP32_PINMUX(47, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO48 ESP32_PINMUX(48, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO49 ESP32_PINMUX(49, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO50 ESP32_PINMUX(50, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO51 ESP32_PINMUX(51, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO52 ESP32_PINMUX(52, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO53 ESP32_PINMUX(53, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO54 ESP32_PINMUX(54, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO55 ESP32_PINMUX(55, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO56 ESP32_PINMUX(56, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO57 ESP32_PINMUX(57, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO58 ESP32_PINMUX(58, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO59 ESP32_PINMUX(59, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO60 ESP32_PINMUX(60, ESP_PWM1_F2_IN, ESP_NOSIG)
#define MCPWM1_FAULT2_GPIO61 ESP32_PINMUX(61, ESP_PWM1_F2_IN, ESP_NOSIG)
/** @} */

