zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name MCPWM1_OUT2B
 * @{
 */
#define MCPWM1_OUT2B_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_PWM1_OUT2B)
#define MCPWM1_OUT2B_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_PWM1_OUT2B)
/** @} */

/**
 * @name MCPWM1_SYNC0
 * @{
 */
#define MCPWM1_SYNC0_GPIO0 ESP32_PINMUX(0, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO1 ESP32_PINMUX(1, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO2 ESP32_PINMUX(2, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO3 ESP32_PINMUX(3, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO4 ESP32_PINMUX(4, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO5 ESP32_PINMUX(5, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO6 ESP32_PINMUX(6, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO7 ESP32_PINMUX(7, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO8 ESP32_PINMUX(8, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO9 ESP32_PINMUX(9, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO10 ESP32_PINMUX(10, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO11 ESP32_PINMUX(11, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO12 ESP32_PINMUX(12, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO13 ESP32_PINMUX(13, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO14 ESP32_PINMUX(14, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO15 ESP32_PINMUX(15, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO16 ESP32_PINMUX(16, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO17 ESP32_PINMUX(17, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO18 ESP32_PINMUX(18, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO19 ESP32_PINMUX(19, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO20 ESP32_PINMUX(20, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO21 ESP32_PINMUX(21, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO22 ESP32_PINMUX(22, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO23 ESP32_PINMUX(23, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO24 ESP32_PINMUX(24, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO25 ESP32_PINMUX(25, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO26 ESP32_PINMUX(26, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO27 ESP32_PINMUX(27, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO28 ESP32_PINMUX(28, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO30 ESP32_PINMUX(30, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO31 ESP32_PINMUX(31, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO32 ESP32_PINMUX(32, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO33 ESP32_PINMUX(33, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO34 ESP32_PINMUX(34, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO35 ESP32_PINMUX(35, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO36 ESP32_PINMUX(36, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO37 ESP32_PINMUX(37, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO38 ESP32_PINMUX(38, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO39 ESP32_PINMUX(39, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO40 ESP32_PINMUX(40, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO42 ESP32_PINMUX(42, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO43 ESP32_PINMUX(43, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO44 ESP32_PINMUX(44, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO45 ESP32_PINMUX(45, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO46 ESP32_PINMUX(46, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO47 ESP32_PINMUX(47, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO48 ESP32_PINMUX(48, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO49 ESP32_PINMUX(49, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO50 ESP32_PINMUX(50, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO51 ESP32_PINMUX(51, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO52 ESP32_PINMUX(52, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO53 ESP32_PINMUX(53, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO54 ESP32_PINMUX(54, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO55 ESP32_PINMUX(55, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO56 ESP32_PINMUX(56, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO57 ESP32_PINMUX(57, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO58 ESP32_PINMUX(58, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO59 ESP32_PINMUX(59, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO60 ESP32_PINMUX(60, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
#define MCPWM1_SYNC0_GPIO61 ESP32_PINMUX(61, ESP_PWM1_SYNC0_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_SYNC1
 * @{
 */
#define MCPWM1_SYNC1_GPIO0 ESP32_PINMUX(0, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO1 ESP32_PINMUX(1, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO2 ESP32_PINMUX(2, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO3 ESP32_PINMUX(3, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO4 ESP32_PINMUX(4, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO5 ESP32_PINMUX(5, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO6 ESP32_PINMUX(6, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO7 ESP32_PINMUX(7, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO8 ESP32_PINMUX(8, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO9 ESP32_PINMUX(9, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO10 ESP32_PINMUX(10, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO11 ESP32_PINMUX(11, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO12 ESP32_PINMUX(12, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO13 ESP32_PINMUX(13, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO14 ESP32_PINMUX(14, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO15 ESP32_PINMUX(15, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO16 ESP32_PINMUX(16, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO17 ESP32_PINMUX(17, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO18 ESP32_PINMUX(18, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO19 ESP32_PINMUX(19, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO20 ESP32_PINMUX(20, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO21 ESP32_PINMUX(21, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO22 ESP32_PINMUX(22, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO23 ESP32_PINMUX(23, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO24 ESP32_PINMUX(24, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO25 ESP32_PINMUX(25, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO26 ESP32_PINMUX(26, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO27 ESP32_PINMUX(27, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO28 ESP32_PINMUX(28, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO30 ESP32_PINMUX(30, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO31 ESP32_PINMUX(31, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO32 ESP32_PINMUX(32, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO33 ESP32_PINMUX(33, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO34 ESP32_PINMUX(34, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO35 ESP32_PINMUX(35, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO36 ESP32_PINMUX(36, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO37 ESP32_PINMUX(37, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO38 ESP32_PINMUX(38, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO39 ESP32_PINMUX(39, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO40 ESP32_PINMUX(40, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO42 ESP32_PINMUX(42, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO43 ESP32_PINMUX(43, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO44 ESP32_PINMUX(44, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO45 ESP32_PINMUX(45, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO46 ESP32_PINMUX(46, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO47 ESP32_PINMUX(47, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO48 ESP32_PINMUX(48, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO49 ESP32_PINMUX(49, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO50 ESP32_PINMUX(50, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO51 ESP32_PINMUX(51, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO52 ESP32_PINMUX(52, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO53 ESP32_PINMUX(53, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO54 ESP32_PINMUX(54, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO55 ESP32_PINMUX(55, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO56 ESP32_PINMUX(56, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO57 ESP32_PINMUX(57, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO58 ESP32_PINMUX(58, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO59 ESP32_PINMUX(59, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO60 ESP32_PINMUX(60, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
#define MCPWM1_SYNC1_GPIO61 ESP32_PINMUX(61, ESP_PWM1_SYNC1_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM1_SYNC2
 * @{
 */
#define MCPWM1_SYNC2_GPIO0 ESP32_PINMUX(0, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO1 ESP32_PINMUX(1, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO2 ESP32_PINMUX(2, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO3 ESP32_PINMUX(3, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO4 ESP32_PINMUX(4, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO5 ESP32_PINMUX(5, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO6 ESP32_PINMUX(6, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO7 ESP32_PINMUX(7, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO8 ESP32_PINMUX(8, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO9 ESP32_PINMUX(9, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO10 ESP32_PINMUX(10, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO11 ESP32_PINMUX(11, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO12 ESP32_PINMUX(12, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO13 ESP32_PINMUX(13, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO14 ESP32_PINMUX(14, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO15 ESP32_PINMUX(15, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO16 ESP32_PINMUX(16, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO17 ESP32_PINMUX(17, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO18 ESP32_PINMUX(18, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO19 ESP32_PINMUX(19, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO20 ESP32_PINMUX(20, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO21 ESP32_PINMUX(21, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO22 ESP32_PINMUX(22, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO23 ESP32_PINMUX(23, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO24 ESP32_PINMUX(24, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO25 ESP32_PINMUX(25, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO26 ESP32_PINMUX(26, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO27 ESP32_PINMUX(27, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO28 ESP32_PINMUX(28, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO30 ESP32_PINMUX(30, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO31 ESP32_PINMUX(31, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO32 ESP32_PINMUX(32, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO33 ESP32_PINMUX(33, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO34 ESP32_PINMUX(34, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO35 ESP32_PINMUX(35, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO36 ESP32_PINMUX(36, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO37 ESP32_PINMUX(37, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO38 ESP32_PINMUX(38, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO39 ESP32_PINMUX(39, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO40 ESP32_PINMUX(40, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO42 ESP32_PINMUX(42, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO43 ESP32_PINMUX(43, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO44 ESP32_PINMUX(44, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO45 ESP32_PINMUX(45, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO46 ESP32_PINMUX(46, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO47 ESP32_PINMUX(47, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO48 ESP32_PINMUX(48, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO49 ESP32_PINMUX(49, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO50 ESP32_PINMUX(50, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO51 ESP32_PINMUX(51, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO52 ESP32_PINMUX(52, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO53 ESP32_PINMUX(53, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO54 ESP32_PINMUX(54, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO55 ESP32_PINMUX(55, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO56 ESP32_PINMUX(56, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO57 ESP32_PINMUX(57, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO58 ESP32_PINMUX(58, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO59 ESP32_PINMUX(59, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO60 ESP32_PINMUX(60, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
#define MCPWM1_SYNC2_GPIO61 ESP32_PINMUX(61, ESP_PWM1_SYNC2_IN, ESP_NOSIG)
/** @} */

/**
 * @name MCPWM2_CAP0
 * @{
 */
#define MCPWM2_CAP0_GPIO0 ESP32_PINMUX(0, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO1 ESP32_PINMUX(1, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO2 ESP32_PINMUX(2, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO3 ESP32_PINMUX(3, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO4 ESP32_PINMUX(4, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO5 ESP32_PINMUX(5, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO6 ESP32_PINMUX(6, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO7 ESP32_PINMUX(7, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO8 ESP32_PINMUX(8, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO9 ESP32_PINMUX(9, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO10 ESP32_PINMUX(10, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO11 ESP32_PINMUX(11, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO12 ESP32_PINMUX(12, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO13 ESP32_PINMUX(13, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO14 ESP32_PINMUX(14, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO15 ESP32_PINMUX(15, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO16 ESP32_PINMUX(16, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO17 ESP32_PINMUX(17, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO18 ESP32_PINMUX(18, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO19 ESP32_PINMUX(19, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO20 ESP32_PINMUX(20, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO21 ESP32_PINMUX(21, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO22 ESP32_PINMUX(22, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO23 ESP32_PINMUX(23, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO24 ESP32_PINMUX(24, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO25 ESP32_PINMUX(25, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO26 ESP32_PINMUX(26, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO27 ESP32_PINMUX(27, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO28 ESP32_PINMUX(28, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO30 ESP32_PINMUX(30, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO31 ESP32_PINMUX(31, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO32 ESP32_PINMUX(32, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO33 ESP32_PINMUX(33, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO34 ESP32_PINMUX(34, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO35 ESP32_PINMUX(35, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO36 ESP32_PINMUX(36, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO37 ESP32_PINMUX(37, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO38 ESP32_PINMUX(38, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO39 ESP32_PINMUX(39, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO40 ESP32_PINMUX(40, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO42 ESP32_PINMUX(42, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO43 ESP32_PINMUX(43, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO44 ESP32_PINMUX(44, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO45 ESP32_PINMUX(45, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO46 ESP32_PINMUX(46, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO47 ESP32_PINMUX(47, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO48 ESP32_PINMUX(48, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO49 ESP32_PINMUX(49, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO50 ESP32_PINMUX(50, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO51 ESP32_PINMUX(51, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO52 ESP32_PINMUX(52, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO53 ESP32_PINMUX(53, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO54 ESP32_PINMUX(54, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO55 ESP32_PINMUX(55, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO56 ESP32_PINMUX(56, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO57 ESP32_PINMUX(57, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO58 ESP32_PINMUX(58, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO59 ESP32_PINMUX(59, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO60 ESP32_PINMUX(60, ESP_PWM2_CAP0_IN, ESP_NOSIG)
#define MCPWM2_CAP0_GPIO61 ESP32_PINMUX(61, ESP_PWM2_CAP0_IN, ESP_NOSIG)
/** @} */

