zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name PARLIO_DATA1
 * @{
 */
#define PARLIO_DATA1_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
#define PARLIO_DATA1_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA1_IN, ESP_PARLIO_TX_DATA1_OUT)
/** @} */

/**
 * @name PARLIO_DATA10
 * @{
 */
#define PARLIO_DATA10_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
#define PARLIO_DATA10_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA10_IN, ESP_PARLIO_TX_DATA10_OUT)
/** @} */

/**
 * @name PARLIO_DATA11
 * @{
 */
#define PARLIO_DATA11_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
#define PARLIO_DATA11_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA11_IN, ESP_PARLIO_TX_DATA11_OUT)
/** @} */

/**
 * @name PARLIO_DATA12
 * @{
 */
#define PARLIO_DATA12_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
#define PARLIO_DATA12_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA12_IN, ESP_PARLIO_TX_DATA12_OUT)
/** @} */

