zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name PARLIO_DATA13
 * @{
 */
#define PARLIO_DATA13_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
#define PARLIO_DATA13_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA13_IN, ESP_PARLIO_TX_DATA13_OUT)
/** @} */

/**
 * @name PARLIO_DATA14
 * @{
 */
#define PARLIO_DATA14_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
#define PARLIO_DATA14_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA14_IN, ESP_PARLIO_TX_DATA14_OUT)
/** @} */

/**
 * @name PARLIO_DATA15
 * @{
 */
#define PARLIO_DATA15_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
#define PARLIO_DATA15_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA15_IN, ESP_PARLIO_TX_DATA15_OUT)
/** @} */

/**
 * @name PARLIO_DATA2
 * @{
 */
#define PARLIO_DATA2_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
#define PARLIO_DATA2_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA2_IN, ESP_PARLIO_TX_DATA2_OUT)
/** @} */

