zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name PARLIO_DATA3
 * @{
 */
#define PARLIO_DATA3_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
#define PARLIO_DATA3_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA3_IN, ESP_PARLIO_TX_DATA3_OUT)
/** @} */

/**
 * @name PARLIO_DATA4
 * @{
 */
#define PARLIO_DATA4_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
#define PARLIO_DATA4_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA4_IN, ESP_PARLIO_TX_DATA4_OUT)
/** @} */

/**
 * @name PARLIO_DATA5
 * @{
 */
#define PARLIO_DATA5_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
#define PARLIO_DATA5_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA5_IN, ESP_PARLIO_TX_DATA5_OUT)
/** @} */

/**
 * @name PARLIO_DATA6
 * @{
 */
#define PARLIO_DATA6_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
#define PARLIO_DATA6_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA6_IN, ESP_PARLIO_TX_DATA6_OUT)
/** @} */

