zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name PARLIO_DATA7
 * @{
 */
#define PARLIO_DATA7_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
#define PARLIO_DATA7_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA7_IN, ESP_PARLIO_TX_DATA7_OUT)
/** @} */

/**
 * @name PARLIO_DATA8
 * @{
 */
#define PARLIO_DATA8_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
#define PARLIO_DATA8_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA8_IN, ESP_PARLIO_TX_DATA8_OUT)
/** @} */

/**
 * @name PARLIO_DATA9
 * @{
 */
#define PARLIO_DATA9_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
#define PARLIO_DATA9_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_DATA9_IN, ESP_PARLIO_TX_DATA9_OUT)
/** @} */

/**
 * @name PARLIO_RX_CLK
 * @{
 */
#define PARLIO_RX_CLK_GPIO0 ESP32_PINMUX(0, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO1 ESP32_PINMUX(1, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO2 ESP32_PINMUX(2, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO3 ESP32_PINMUX(3, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO4 ESP32_PINMUX(4, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO5 ESP32_PINMUX(5, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO6 ESP32_PINMUX(6, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO7 ESP32_PINMUX(7, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO8 ESP32_PINMUX(8, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO9 ESP32_PINMUX(9, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO10 ESP32_PINMUX(10, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO11 ESP32_PINMUX(11, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO12 ESP32_PINMUX(12, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO13 ESP32_PINMUX(13, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO14 ESP32_PINMUX(14, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO15 ESP32_PINMUX(15, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO16 ESP32_PINMUX(16, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO17 ESP32_PINMUX(17, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO18 ESP32_PINMUX(18, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO19 ESP32_PINMUX(19, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO20 ESP32_PINMUX(20, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO21 ESP32_PINMUX(21, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO22 ESP32_PINMUX(22, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO23 ESP32_PINMUX(23, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO24 ESP32_PINMUX(24, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO25 ESP32_PINMUX(25, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO26 ESP32_PINMUX(26, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO27 ESP32_PINMUX(27, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO28 ESP32_PINMUX(28, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO30 ESP32_PINMUX(30, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO31 ESP32_PINMUX(31, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO32 ESP32_PINMUX(32, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO33 ESP32_PINMUX(33, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO34 ESP32_PINMUX(34, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO35 ESP32_PINMUX(35, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO36 ESP32_PINMUX(36, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO37 ESP32_PINMUX(37, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO38 ESP32_PINMUX(38, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO39 ESP32_PINMUX(39, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO40 ESP32_PINMUX(40, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO42 ESP32_PINMUX(42, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO43 ESP32_PINMUX(43, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO44 ESP32_PINMUX(44, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO45 ESP32_PINMUX(45, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO46 ESP32_PINMUX(46, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO47 ESP32_PINMUX(47, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO48 ESP32_PINMUX(48, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO49 ESP32_PINMUX(49, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO50 ESP32_PINMUX(50, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO51 ESP32_PINMUX(51, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO52 ESP32_PINMUX(52, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO53 ESP32_PINMUX(53, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO54 ESP32_PINMUX(54, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO55 ESP32_PINMUX(55, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO56 ESP32_PINMUX(56, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO57 ESP32_PINMUX(57, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO58 ESP32_PINMUX(58, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO59 ESP32_PINMUX(59, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO60 ESP32_PINMUX(60, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
#define PARLIO_RX_CLK_GPIO61 ESP32_PINMUX(61, ESP_PARLIO_RX_CLK_IN, ESP_PARLIO_RX_CLK_OUT)
/** @} */

