zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name PCNT3_CH1CTRL
 * @{
 */
#define PCNT3_CH1CTRL_GPIO0 ESP32_PINMUX(0, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO1 ESP32_PINMUX(1, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO2 ESP32_PINMUX(2, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO3 ESP32_PINMUX(3, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO4 ESP32_PINMUX(4, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO5 ESP32_PINMUX(5, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO6 ESP32_PINMUX(6, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO7 ESP32_PINMUX(7, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO8 ESP32_PINMUX(8, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO9 ESP32_PINMUX(9, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO10 ESP32_PINMUX(10, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO11 ESP32_PINMUX(11, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO12 ESP32_PINMUX(12, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO13 ESP32_PINMUX(13, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO14 ESP32_PINMUX(14, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO15 ESP32_PINMUX(15, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO16 ESP32_PINMUX(16, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO17 ESP32_PINMUX(17, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO18 ESP32_PINMUX(18, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO19 ESP32_PINMUX(19, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO20 ESP32_PINMUX(20, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO21 ESP32_PINMUX(21, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO22 ESP32_PINMUX(22, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO23 ESP32_PINMUX(23, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO24 ESP32_PINMUX(24, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO25 ESP32_PINMUX(25, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO26 ESP32_PINMUX(26, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO27 ESP32_PINMUX(27, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO28 ESP32_PINMUX(28, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO30 ESP32_PINMUX(30, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO31 ESP32_PINMUX(31, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO32 ESP32_PINMUX(32, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO33 ESP32_PINMUX(33, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO34 ESP32_PINMUX(34, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO35 ESP32_PINMUX(35, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO36 ESP32_PINMUX(36, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO37 ESP32_PINMUX(37, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO38 ESP32_PINMUX(38, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO39 ESP32_PINMUX(39, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO40 ESP32_PINMUX(40, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO42 ESP32_PINMUX(42, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO43 ESP32_PINMUX(43, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO44 ESP32_PINMUX(44, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO45 ESP32_PINMUX(45, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO46 ESP32_PINMUX(46, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO47 ESP32_PINMUX(47, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO48 ESP32_PINMUX(48, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO49 ESP32_PINMUX(49, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO50 ESP32_PINMUX(50, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO51 ESP32_PINMUX(51, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO52 ESP32_PINMUX(52, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO53 ESP32_PINMUX(53, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO54 ESP32_PINMUX(54, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO55 ESP32_PINMUX(55, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO56 ESP32_PINMUX(56, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO57 ESP32_PINMUX(57, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO58 ESP32_PINMUX(58, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO59 ESP32_PINMUX(59, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO60 ESP32_PINMUX(60, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1CTRL_GPIO61 ESP32_PINMUX(61, ESP_PCNT0_CTRL_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name PCNT3_CH1SIG
 * @{
 */
#define PCNT3_CH1SIG_GPIO0 ESP32_PINMUX(0, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO1 ESP32_PINMUX(1, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO2 ESP32_PINMUX(2, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO3 ESP32_PINMUX(3, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO4 ESP32_PINMUX(4, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO5 ESP32_PINMUX(5, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO6 ESP32_PINMUX(6, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO7 ESP32_PINMUX(7, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO8 ESP32_PINMUX(8, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO9 ESP32_PINMUX(9, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO10 ESP32_PINMUX(10, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO11 ESP32_PINMUX(11, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO12 ESP32_PINMUX(12, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO13 ESP32_PINMUX(13, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO14 ESP32_PINMUX(14, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO15 ESP32_PINMUX(15, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO16 ESP32_PINMUX(16, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO17 ESP32_PINMUX(17, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO18 ESP32_PINMUX(18, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO19 ESP32_PINMUX(19, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO20 ESP32_PINMUX(20, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO21 ESP32_PINMUX(21, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO22 ESP32_PINMUX(22, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO23 ESP32_PINMUX(23, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO24 ESP32_PINMUX(24, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO25 ESP32_PINMUX(25, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO26 ESP32_PINMUX(26, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO27 ESP32_PINMUX(27, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO28 ESP32_PINMUX(28, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO30 ESP32_PINMUX(30, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO31 ESP32_PINMUX(31, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO32 ESP32_PINMUX(32, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO33 ESP32_PINMUX(33, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO34 ESP32_PINMUX(34, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO35 ESP32_PINMUX(35, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO36 ESP32_PINMUX(36, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO37 ESP32_PINMUX(37, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO38 ESP32_PINMUX(38, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO39 ESP32_PINMUX(39, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO40 ESP32_PINMUX(40, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO42 ESP32_PINMUX(42, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO43 ESP32_PINMUX(43, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO44 ESP32_PINMUX(44, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO45 ESP32_PINMUX(45, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO46 ESP32_PINMUX(46, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO47 ESP32_PINMUX(47, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO48 ESP32_PINMUX(48, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO49 ESP32_PINMUX(49, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO50 ESP32_PINMUX(50, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO51 ESP32_PINMUX(51, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO52 ESP32_PINMUX(52, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO53 ESP32_PINMUX(53, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO54 ESP32_PINMUX(54, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO55 ESP32_PINMUX(55, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO56 ESP32_PINMUX(56, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO57 ESP32_PINMUX(57, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO58 ESP32_PINMUX(58, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO59 ESP32_PINMUX(59, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO60 ESP32_PINMUX(60, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
#define PCNT3_CH1SIG_GPIO61 ESP32_PINMUX(61, ESP_PCNT0_SIG_CH1_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN0
 * @{
 */
#define RMT_IN0_GPIO0 ESP32_PINMUX(0, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO1 ESP32_PINMUX(1, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO2 ESP32_PINMUX(2, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO3 ESP32_PINMUX(3, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO4 ESP32_PINMUX(4, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO5 ESP32_PINMUX(5, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO6 ESP32_PINMUX(6, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO7 ESP32_PINMUX(7, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO8 ESP32_PINMUX(8, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO9 ESP32_PINMUX(9, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO47 ESP32_PINMUX(47, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO48 ESP32_PINMUX(48, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO49 ESP32_PINMUX(49, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO50 ESP32_PINMUX(50, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO51 ESP32_PINMUX(51, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO52 ESP32_PINMUX(52, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO53 ESP32_PINMUX(53, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO54 ESP32_PINMUX(54, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO55 ESP32_PINMUX(55, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO56 ESP32_PINMUX(56, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO57 ESP32_PINMUX(57, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO58 ESP32_PINMUX(58, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO59 ESP32_PINMUX(59, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO60 ESP32_PINMUX(60, ESP_RMT_SIG_IN0, ESP_NOSIG)
#define RMT_IN0_GPIO61 ESP32_PINMUX(61, ESP_RMT_SIG_IN0, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN1
 * @{
 */
#define RMT_IN1_GPIO0 ESP32_PINMUX(0, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO1 ESP32_PINMUX(1, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO2 ESP32_PINMUX(2, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO3 ESP32_PINMUX(3, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO4 ESP32_PINMUX(4, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO5 ESP32_PINMUX(5, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO6 ESP32_PINMUX(6, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO7 ESP32_PINMUX(7, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO8 ESP32_PINMUX(8, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO9 ESP32_PINMUX(9, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO47 ESP32_PINMUX(47, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO48 ESP32_PINMUX(48, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO49 ESP32_PINMUX(49, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO50 ESP32_PINMUX(50, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO51 ESP32_PINMUX(51, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO52 ESP32_PINMUX(52, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO53 ESP32_PINMUX(53, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO54 ESP32_PINMUX(54, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO55 ESP32_PINMUX(55, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO56 ESP32_PINMUX(56, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO57 ESP32_PINMUX(57, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO58 ESP32_PINMUX(58, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO59 ESP32_PINMUX(59, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO60 ESP32_PINMUX(60, ESP_RMT_SIG_IN1, ESP_NOSIG)
#define RMT_IN1_GPIO61 ESP32_PINMUX(61, ESP_RMT_SIG_IN1, ESP_NOSIG)
/** @} */

/**
 * @name RMT_IN2
 * @{
 */
#define RMT_IN2_GPIO0 ESP32_PINMUX(0, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO1 ESP32_PINMUX(1, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO2 ESP32_PINMUX(2, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO3 ESP32_PINMUX(3, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO4 ESP32_PINMUX(4, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO5 ESP32_PINMUX(5, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO6 ESP32_PINMUX(6, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO7 ESP32_PINMUX(7, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO8 ESP32_PINMUX(8, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO9 ESP32_PINMUX(9, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO47 ESP32_PINMUX(47, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO48 ESP32_PINMUX(48, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO49 ESP32_PINMUX(49, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO50 ESP32_PINMUX(50, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO51 ESP32_PINMUX(51, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO52 ESP32_PINMUX(52, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO53 ESP32_PINMUX(53, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO54 ESP32_PINMUX(54, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO55 ESP32_PINMUX(55, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO56 ESP32_PINMUX(56, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO57 ESP32_PINMUX(57, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO58 ESP32_PINMUX(58, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO59 ESP32_PINMUX(59, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO60 ESP32_PINMUX(60, ESP_RMT_SIG_IN2, ESP_NOSIG)
#define RMT_IN2_GPIO61 ESP32_PINMUX(61, ESP_RMT_SIG_IN2, ESP_NOSIG)
/** @} */

