zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name RMT_IN3
 * @{
 */
#define RMT_IN3_GPIO0 ESP32_PINMUX(0, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO1 ESP32_PINMUX(1, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO2 ESP32_PINMUX(2, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO3 ESP32_PINMUX(3, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO4 ESP32_PINMUX(4, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO5 ESP32_PINMUX(5, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO6 ESP32_PINMUX(6, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO7 ESP32_PINMUX(7, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO8 ESP32_PINMUX(8, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO9 ESP32_PINMUX(9, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO10 ESP32_PINMUX(10, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO11 ESP32_PINMUX(11, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO12 ESP32_PINMUX(12, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO13 ESP32_PINMUX(13, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO14 ESP32_PINMUX(14, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO15 ESP32_PINMUX(15, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO16 ESP32_PINMUX(16, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO17 ESP32_PINMUX(17, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO18 ESP32_PINMUX(18, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO19 ESP32_PINMUX(19, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO20 ESP32_PINMUX(20, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO21 ESP32_PINMUX(21, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO22 ESP32_PINMUX(22, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO23 ESP32_PINMUX(23, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO24 ESP32_PINMUX(24, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO25 ESP32_PINMUX(25, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO26 ESP32_PINMUX(26, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO27 ESP32_PINMUX(27, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO28 ESP32_PINMUX(28, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO30 ESP32_PINMUX(30, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO31 ESP32_PINMUX(31, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO32 ESP32_PINMUX(32, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO33 ESP32_PINMUX(33, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO34 ESP32_PINMUX(34, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO35 ESP32_PINMUX(35, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO36 ESP32_PINMUX(36, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO37 ESP32_PINMUX(37, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO38 ESP32_PINMUX(38, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO39 ESP32_PINMUX(39, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO40 ESP32_PINMUX(40, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO42 ESP32_PINMUX(42, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO43 ESP32_PINMUX(43, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO44 ESP32_PINMUX(44, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO45 ESP32_PINMUX(45, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO46 ESP32_PINMUX(46, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO47 ESP32_PINMUX(47, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO48 ESP32_PINMUX(48, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO49 ESP32_PINMUX(49, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO50 ESP32_PINMUX(50, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO51 ESP32_PINMUX(51, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO52 ESP32_PINMUX(52, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO53 ESP32_PINMUX(53, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO54 ESP32_PINMUX(54, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO55 ESP32_PINMUX(55, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO56 ESP32_PINMUX(56, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO57 ESP32_PINMUX(57, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO58 ESP32_PINMUX(58, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO59 ESP32_PINMUX(59, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO60 ESP32_PINMUX(60, ESP_RMT_SIG_IN3, ESP_NOSIG)
#define RMT_IN3_GPIO61 ESP32_PINMUX(61, ESP_RMT_SIG_IN3, ESP_NOSIG)
/** @} */

/**
 * @name RMT_OUT0
 * @{
 */
#define RMT_OUT0_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_RMT_SIG_OUT0)
#define RMT_OUT0_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_RMT_SIG_OUT0)
/** @} */

/**
 * @name RMT_OUT1
 * @{
 */
#define RMT_OUT1_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_RMT_SIG_OUT1)
#define RMT_OUT1_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_RMT_SIG_OUT1)
/** @} */

/**
 * @name RMT_OUT2
 * @{
 */
#define RMT_OUT2_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_RMT_SIG_OUT2)
#define RMT_OUT2_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_RMT_SIG_OUT2)
/** @} */

/**
 * @name RMT_OUT3
 * @{
 */
#define RMT_OUT3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_RMT_SIG_OUT3)
#define RMT_OUT3_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_RMT_SIG_OUT3)
/** @} */

