zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name SPIM2_CSEL
 * @{
 */
#define SPIM2_CSEL_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_FSPICS0_OUT)
#define SPIM2_CSEL_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_FSPICS0_OUT)
/** @} */

/**
 * @name SPIM2_HOLD_IO3
 * @{
 */
#define SPIM2_HOLD_IO3_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_FSPIHD_OUT)
#define SPIM2_HOLD_IO3_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_FSPIHD_OUT)
/** @} */

/**
 * @name SPIM2_MISO
 * @{
 */
#define SPIM2_MISO_GPIO0 ESP32_PINMUX(0, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO1 ESP32_PINMUX(1, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO2 ESP32_PINMUX(2, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO3 ESP32_PINMUX(3, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO4 ESP32_PINMUX(4, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO5 ESP32_PINMUX(5, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO6 ESP32_PINMUX(6, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO7 ESP32_PINMUX(7, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO8 ESP32_PINMUX(8, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO9 ESP32_PINMUX(9, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO15 ESP32_PINMUX(15, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO16 ESP32_PINMUX(16, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO17 ESP32_PINMUX(17, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO18 ESP32_PINMUX(18, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO19 ESP32_PINMUX(19, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO20 ESP32_PINMUX(20, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO21 ESP32_PINMUX(21, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO22 ESP32_PINMUX(22, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO23 ESP32_PINMUX(23, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO24 ESP32_PINMUX(24, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO25 ESP32_PINMUX(25, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO26 ESP32_PINMUX(26, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO27 ESP32_PINMUX(27, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO28 ESP32_PINMUX(28, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO30 ESP32_PINMUX(30, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO31 ESP32_PINMUX(31, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO32 ESP32_PINMUX(32, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO33 ESP32_PINMUX(33, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO34 ESP32_PINMUX(34, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO35 ESP32_PINMUX(35, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO36 ESP32_PINMUX(36, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO37 ESP32_PINMUX(37, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO38 ESP32_PINMUX(38, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO39 ESP32_PINMUX(39, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO40 ESP32_PINMUX(40, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO42 ESP32_PINMUX(42, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO43 ESP32_PINMUX(43, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO44 ESP32_PINMUX(44, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO45 ESP32_PINMUX(45, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO46 ESP32_PINMUX(46, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO47 ESP32_PINMUX(47, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO48 ESP32_PINMUX(48, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO49 ESP32_PINMUX(49, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO50 ESP32_PINMUX(50, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO51 ESP32_PINMUX(51, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO52 ESP32_PINMUX(52, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO53 ESP32_PINMUX(53, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO54 ESP32_PINMUX(54, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO55 ESP32_PINMUX(55, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO56 ESP32_PINMUX(56, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO57 ESP32_PINMUX(57, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO58 ESP32_PINMUX(58, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO59 ESP32_PINMUX(59, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO60 ESP32_PINMUX(60, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_GPIO61 ESP32_PINMUX(61, ESP_FSPIQ_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIM2_MISO_IO0
 * @{
 */
#define SPIM2_MISO_IO0_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_FSPID_OUT)
#define SPIM2_MISO_IO0_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_FSPID_OUT)
/** @} */

/**
 * @name SPIM2_MISO_IO1
 * @{
 */
#define SPIM2_MISO_IO1_GPIO0 ESP32_PINMUX(0, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO1 ESP32_PINMUX(1, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO2 ESP32_PINMUX(2, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO3 ESP32_PINMUX(3, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO4 ESP32_PINMUX(4, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO5 ESP32_PINMUX(5, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO6 ESP32_PINMUX(6, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO7 ESP32_PINMUX(7, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO8 ESP32_PINMUX(8, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO9 ESP32_PINMUX(9, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO10 ESP32_PINMUX(10, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO11 ESP32_PINMUX(11, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO12 ESP32_PINMUX(12, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO13 ESP32_PINMUX(13, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO14 ESP32_PINMUX(14, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO15 ESP32_PINMUX(15, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO16 ESP32_PINMUX(16, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO17 ESP32_PINMUX(17, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO18 ESP32_PINMUX(18, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO19 ESP32_PINMUX(19, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO20 ESP32_PINMUX(20, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO21 ESP32_PINMUX(21, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO22 ESP32_PINMUX(22, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO23 ESP32_PINMUX(23, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO24 ESP32_PINMUX(24, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO25 ESP32_PINMUX(25, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO26 ESP32_PINMUX(26, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO27 ESP32_PINMUX(27, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO28 ESP32_PINMUX(28, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO30 ESP32_PINMUX(30, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO31 ESP32_PINMUX(31, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO32 ESP32_PINMUX(32, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO33 ESP32_PINMUX(33, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO34 ESP32_PINMUX(34, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO35 ESP32_PINMUX(35, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO36 ESP32_PINMUX(36, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO37 ESP32_PINMUX(37, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO38 ESP32_PINMUX(38, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO39 ESP32_PINMUX(39, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO40 ESP32_PINMUX(40, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO42 ESP32_PINMUX(42, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO43 ESP32_PINMUX(43, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO44 ESP32_PINMUX(44, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO45 ESP32_PINMUX(45, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO46 ESP32_PINMUX(46, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO47 ESP32_PINMUX(47, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO48 ESP32_PINMUX(48, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO49 ESP32_PINMUX(49, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO50 ESP32_PINMUX(50, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO51 ESP32_PINMUX(51, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO52 ESP32_PINMUX(52, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO53 ESP32_PINMUX(53, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO54 ESP32_PINMUX(54, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO55 ESP32_PINMUX(55, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO56 ESP32_PINMUX(56, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO57 ESP32_PINMUX(57, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO58 ESP32_PINMUX(58, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO59 ESP32_PINMUX(59, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO60 ESP32_PINMUX(60, ESP_FSPIQ_IN, ESP_NOSIG)
#define SPIM2_MISO_IO1_GPIO61 ESP32_PINMUX(61, ESP_FSPIQ_IN, ESP_NOSIG)
/** @} */

