zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name SPIS2_SCLK
 * @{
 */
#define SPIS2_SCLK_GPIO0 ESP32_PINMUX(0, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO1 ESP32_PINMUX(1, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO2 ESP32_PINMUX(2, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO3 ESP32_PINMUX(3, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO4 ESP32_PINMUX(4, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO5 ESP32_PINMUX(5, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO6 ESP32_PINMUX(6, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO7 ESP32_PINMUX(7, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO8 ESP32_PINMUX(8, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO9 ESP32_PINMUX(9, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO10 ESP32_PINMUX(10, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO11 ESP32_PINMUX(11, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO12 ESP32_PINMUX(12, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO13 ESP32_PINMUX(13, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO14 ESP32_PINMUX(14, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO15 ESP32_PINMUX(15, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO16 ESP32_PINMUX(16, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO17 ESP32_PINMUX(17, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO18 ESP32_PINMUX(18, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO19 ESP32_PINMUX(19, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO20 ESP32_PINMUX(20, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO21 ESP32_PINMUX(21, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO22 ESP32_PINMUX(22, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO23 ESP32_PINMUX(23, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO24 ESP32_PINMUX(24, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO25 ESP32_PINMUX(25, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO26 ESP32_PINMUX(26, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO27 ESP32_PINMUX(27, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO28 ESP32_PINMUX(28, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO30 ESP32_PINMUX(30, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO31 ESP32_PINMUX(31, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO32 ESP32_PINMUX(32, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO33 ESP32_PINMUX(33, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO34 ESP32_PINMUX(34, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO35 ESP32_PINMUX(35, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO36 ESP32_PINMUX(36, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO37 ESP32_PINMUX(37, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO38 ESP32_PINMUX(38, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO39 ESP32_PINMUX(39, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO40 ESP32_PINMUX(40, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO42 ESP32_PINMUX(42, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO43 ESP32_PINMUX(43, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO44 ESP32_PINMUX(44, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO45 ESP32_PINMUX(45, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO46 ESP32_PINMUX(46, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO47 ESP32_PINMUX(47, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO48 ESP32_PINMUX(48, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO49 ESP32_PINMUX(49, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO50 ESP32_PINMUX(50, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO51 ESP32_PINMUX(51, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO52 ESP32_PINMUX(52, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO53 ESP32_PINMUX(53, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO54 ESP32_PINMUX(54, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO55 ESP32_PINMUX(55, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO56 ESP32_PINMUX(56, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO57 ESP32_PINMUX(57, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO58 ESP32_PINMUX(58, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO59 ESP32_PINMUX(59, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO60 ESP32_PINMUX(60, ESP_FSPICLK_IN, ESP_NOSIG)
#define SPIS2_SCLK_GPIO61 ESP32_PINMUX(61, ESP_FSPICLK_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_CSEL
 * @{
 */
#define SPIS3_CSEL_GPIO0 ESP32_PINMUX(0, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO1 ESP32_PINMUX(1, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO2 ESP32_PINMUX(2, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO3 ESP32_PINMUX(3, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO4 ESP32_PINMUX(4, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO5 ESP32_PINMUX(5, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO6 ESP32_PINMUX(6, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO7 ESP32_PINMUX(7, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO8 ESP32_PINMUX(8, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO9 ESP32_PINMUX(9, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO10 ESP32_PINMUX(10, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO11 ESP32_PINMUX(11, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO12 ESP32_PINMUX(12, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO13 ESP32_PINMUX(13, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO14 ESP32_PINMUX(14, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO15 ESP32_PINMUX(15, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO16 ESP32_PINMUX(16, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO17 ESP32_PINMUX(17, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO18 ESP32_PINMUX(18, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO19 ESP32_PINMUX(19, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO20 ESP32_PINMUX(20, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO21 ESP32_PINMUX(21, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO22 ESP32_PINMUX(22, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO23 ESP32_PINMUX(23, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO24 ESP32_PINMUX(24, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO25 ESP32_PINMUX(25, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO26 ESP32_PINMUX(26, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO27 ESP32_PINMUX(27, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO28 ESP32_PINMUX(28, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO30 ESP32_PINMUX(30, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO31 ESP32_PINMUX(31, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO32 ESP32_PINMUX(32, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO33 ESP32_PINMUX(33, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO34 ESP32_PINMUX(34, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO35 ESP32_PINMUX(35, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO36 ESP32_PINMUX(36, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO37 ESP32_PINMUX(37, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO38 ESP32_PINMUX(38, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO39 ESP32_PINMUX(39, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO40 ESP32_PINMUX(40, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO42 ESP32_PINMUX(42, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO43 ESP32_PINMUX(43, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO44 ESP32_PINMUX(44, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO45 ESP32_PINMUX(45, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO46 ESP32_PINMUX(46, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO47 ESP32_PINMUX(47, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO48 ESP32_PINMUX(48, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO49 ESP32_PINMUX(49, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO50 ESP32_PINMUX(50, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO51 ESP32_PINMUX(51, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO52 ESP32_PINMUX(52, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO53 ESP32_PINMUX(53, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO54 ESP32_PINMUX(54, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO55 ESP32_PINMUX(55, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO56 ESP32_PINMUX(56, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO57 ESP32_PINMUX(57, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO58 ESP32_PINMUX(58, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO59 ESP32_PINMUX(59, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO60 ESP32_PINMUX(60, ESP_SPI3_CS_IN, ESP_NOSIG)
#define SPIS3_CSEL_GPIO61 ESP32_PINMUX(61, ESP_SPI3_CS_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_MISO
 * @{
 */
#define SPIS3_MISO_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_SPI3_QO_OUT)
#define SPIS3_MISO_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_SPI3_QO_OUT)
/** @} */

/**
 * @name SPIS3_MOSI
 * @{
 */
#define SPIS3_MOSI_GPIO0 ESP32_PINMUX(0, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO1 ESP32_PINMUX(1, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO2 ESP32_PINMUX(2, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO3 ESP32_PINMUX(3, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO4 ESP32_PINMUX(4, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO5 ESP32_PINMUX(5, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO6 ESP32_PINMUX(6, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO7 ESP32_PINMUX(7, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO8 ESP32_PINMUX(8, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO9 ESP32_PINMUX(9, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO10 ESP32_PINMUX(10, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO11 ESP32_PINMUX(11, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO12 ESP32_PINMUX(12, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO13 ESP32_PINMUX(13, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO14 ESP32_PINMUX(14, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO15 ESP32_PINMUX(15, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO16 ESP32_PINMUX(16, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO17 ESP32_PINMUX(17, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO18 ESP32_PINMUX(18, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO19 ESP32_PINMUX(19, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO20 ESP32_PINMUX(20, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO21 ESP32_PINMUX(21, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO22 ESP32_PINMUX(22, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO23 ESP32_PINMUX(23, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO24 ESP32_PINMUX(24, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO25 ESP32_PINMUX(25, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO26 ESP32_PINMUX(26, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO27 ESP32_PINMUX(27, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO28 ESP32_PINMUX(28, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO30 ESP32_PINMUX(30, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO31 ESP32_PINMUX(31, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO32 ESP32_PINMUX(32, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO33 ESP32_PINMUX(33, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO34 ESP32_PINMUX(34, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO35 ESP32_PINMUX(35, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO36 ESP32_PINMUX(36, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO37 ESP32_PINMUX(37, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO38 ESP32_PINMUX(38, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO39 ESP32_PINMUX(39, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO40 ESP32_PINMUX(40, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO42 ESP32_PINMUX(42, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO43 ESP32_PINMUX(43, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO44 ESP32_PINMUX(44, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO45 ESP32_PINMUX(45, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO46 ESP32_PINMUX(46, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO47 ESP32_PINMUX(47, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO48 ESP32_PINMUX(48, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO49 ESP32_PINMUX(49, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO50 ESP32_PINMUX(50, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO51 ESP32_PINMUX(51, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO52 ESP32_PINMUX(52, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO53 ESP32_PINMUX(53, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO54 ESP32_PINMUX(54, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO55 ESP32_PINMUX(55, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO56 ESP32_PINMUX(56, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO57 ESP32_PINMUX(57, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO58 ESP32_PINMUX(58, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO59 ESP32_PINMUX(59, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO60 ESP32_PINMUX(60, ESP_SPI3_D_IN, ESP_NOSIG)
#define SPIS3_MOSI_GPIO61 ESP32_PINMUX(61, ESP_SPI3_D_IN, ESP_NOSIG)
/** @} */

/**
 * @name SPIS3_SCLK
 * @{
 */
#define SPIS3_SCLK_GPIO0 ESP32_PINMUX(0, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO1 ESP32_PINMUX(1, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO2 ESP32_PINMUX(2, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO3 ESP32_PINMUX(3, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO4 ESP32_PINMUX(4, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO5 ESP32_PINMUX(5, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO6 ESP32_PINMUX(6, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO7 ESP32_PINMUX(7, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO8 ESP32_PINMUX(8, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO9 ESP32_PINMUX(9, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO10 ESP32_PINMUX(10, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO11 ESP32_PINMUX(11, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO12 ESP32_PINMUX(12, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO13 ESP32_PINMUX(13, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO14 ESP32_PINMUX(14, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO15 ESP32_PINMUX(15, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO16 ESP32_PINMUX(16, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO17 ESP32_PINMUX(17, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO18 ESP32_PINMUX(18, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO19 ESP32_PINMUX(19, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO20 ESP32_PINMUX(20, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO21 ESP32_PINMUX(21, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO22 ESP32_PINMUX(22, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO23 ESP32_PINMUX(23, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO24 ESP32_PINMUX(24, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO25 ESP32_PINMUX(25, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO26 ESP32_PINMUX(26, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO27 ESP32_PINMUX(27, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO28 ESP32_PINMUX(28, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO30 ESP32_PINMUX(30, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO31 ESP32_PINMUX(31, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO32 ESP32_PINMUX(32, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO33 ESP32_PINMUX(33, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO34 ESP32_PINMUX(34, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO35 ESP32_PINMUX(35, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO36 ESP32_PINMUX(36, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO37 ESP32_PINMUX(37, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO38 ESP32_PINMUX(38, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO39 ESP32_PINMUX(39, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO40 ESP32_PINMUX(40, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO42 ESP32_PINMUX(42, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO43 ESP32_PINMUX(43, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO44 ESP32_PINMUX(44, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO45 ESP32_PINMUX(45, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO46 ESP32_PINMUX(46, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO47 ESP32_PINMUX(47, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO48 ESP32_PINMUX(48, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO49 ESP32_PINMUX(49, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO50 ESP32_PINMUX(50, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO51 ESP32_PINMUX(51, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO52 ESP32_PINMUX(52, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO53 ESP32_PINMUX(53, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO54 ESP32_PINMUX(54, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO55 ESP32_PINMUX(55, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO56 ESP32_PINMUX(56, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO57 ESP32_PINMUX(57, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO58 ESP32_PINMUX(58, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO59 ESP32_PINMUX(59, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO60 ESP32_PINMUX(60, ESP_SPI3_CK_IN, ESP_NOSIG)
#define SPIS3_SCLK_GPIO61 ESP32_PINMUX(61, ESP_SPI3_CK_IN, ESP_NOSIG)
/** @} */

