zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name UART1_CTS
 * @{
 */
#define UART1_CTS_GPIO0 ESP32_PINMUX(0, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO1 ESP32_PINMUX(1, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO2 ESP32_PINMUX(2, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO3 ESP32_PINMUX(3, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO4 ESP32_PINMUX(4, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO5 ESP32_PINMUX(5, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO6 ESP32_PINMUX(6, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO7 ESP32_PINMUX(7, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO8 ESP32_PINMUX(8, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO9 ESP32_PINMUX(9, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO10 ESP32_PINMUX(10, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO11 ESP32_PINMUX(11, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO12 ESP32_PINMUX(12, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO13 ESP32_PINMUX(13, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO14 ESP32_PINMUX(14, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO15 ESP32_PINMUX(15, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO16 ESP32_PINMUX(16, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO17 ESP32_PINMUX(17, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO18 ESP32_PINMUX(18, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO19 ESP32_PINMUX(19, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO20 ESP32_PINMUX(20, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO21 ESP32_PINMUX(21, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO22 ESP32_PINMUX(22, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO23 ESP32_PINMUX(23, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO24 ESP32_PINMUX(24, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO25 ESP32_PINMUX(25, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO26 ESP32_PINMUX(26, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO27 ESP32_PINMUX(27, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO28 ESP32_PINMUX(28, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO30 ESP32_PINMUX(30, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO31 ESP32_PINMUX(31, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO32 ESP32_PINMUX(32, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO33 ESP32_PINMUX(33, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO34 ESP32_PINMUX(34, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO35 ESP32_PINMUX(35, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO36 ESP32_PINMUX(36, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO37 ESP32_PINMUX(37, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO38 ESP32_PINMUX(38, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO39 ESP32_PINMUX(39, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO40 ESP32_PINMUX(40, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO42 ESP32_PINMUX(42, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO43 ESP32_PINMUX(43, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO44 ESP32_PINMUX(44, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO45 ESP32_PINMUX(45, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO46 ESP32_PINMUX(46, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO47 ESP32_PINMUX(47, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO48 ESP32_PINMUX(48, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO49 ESP32_PINMUX(49, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO50 ESP32_PINMUX(50, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO51 ESP32_PINMUX(51, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO52 ESP32_PINMUX(52, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO53 ESP32_PINMUX(53, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO54 ESP32_PINMUX(54, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO55 ESP32_PINMUX(55, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO56 ESP32_PINMUX(56, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO57 ESP32_PINMUX(57, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO58 ESP32_PINMUX(58, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO59 ESP32_PINMUX(59, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO60 ESP32_PINMUX(60, ESP_U1CTS_IN, ESP_NOSIG)
#define UART1_CTS_GPIO61 ESP32_PINMUX(61, ESP_U1CTS_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DSR
 * @{
 */
#define UART1_DSR_GPIO0 ESP32_PINMUX(0, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO1 ESP32_PINMUX(1, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO2 ESP32_PINMUX(2, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO3 ESP32_PINMUX(3, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO4 ESP32_PINMUX(4, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO5 ESP32_PINMUX(5, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO6 ESP32_PINMUX(6, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO7 ESP32_PINMUX(7, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO8 ESP32_PINMUX(8, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO9 ESP32_PINMUX(9, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO10 ESP32_PINMUX(10, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO11 ESP32_PINMUX(11, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO12 ESP32_PINMUX(12, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO13 ESP32_PINMUX(13, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO14 ESP32_PINMUX(14, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO15 ESP32_PINMUX(15, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO16 ESP32_PINMUX(16, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO17 ESP32_PINMUX(17, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO18 ESP32_PINMUX(18, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO19 ESP32_PINMUX(19, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO20 ESP32_PINMUX(20, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO21 ESP32_PINMUX(21, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO22 ESP32_PINMUX(22, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO23 ESP32_PINMUX(23, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO24 ESP32_PINMUX(24, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO25 ESP32_PINMUX(25, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO26 ESP32_PINMUX(26, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO27 ESP32_PINMUX(27, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO28 ESP32_PINMUX(28, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO30 ESP32_PINMUX(30, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO31 ESP32_PINMUX(31, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO32 ESP32_PINMUX(32, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO33 ESP32_PINMUX(33, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO34 ESP32_PINMUX(34, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO35 ESP32_PINMUX(35, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO36 ESP32_PINMUX(36, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO37 ESP32_PINMUX(37, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO38 ESP32_PINMUX(38, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO39 ESP32_PINMUX(39, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO40 ESP32_PINMUX(40, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO42 ESP32_PINMUX(42, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO43 ESP32_PINMUX(43, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO44 ESP32_PINMUX(44, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO45 ESP32_PINMUX(45, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO46 ESP32_PINMUX(46, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO47 ESP32_PINMUX(47, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO48 ESP32_PINMUX(48, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO49 ESP32_PINMUX(49, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO50 ESP32_PINMUX(50, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO51 ESP32_PINMUX(51, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO52 ESP32_PINMUX(52, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO53 ESP32_PINMUX(53, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO54 ESP32_PINMUX(54, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO55 ESP32_PINMUX(55, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO56 ESP32_PINMUX(56, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO57 ESP32_PINMUX(57, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO58 ESP32_PINMUX(58, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO59 ESP32_PINMUX(59, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO60 ESP32_PINMUX(60, ESP_U1DSR_IN, ESP_NOSIG)
#define UART1_DSR_GPIO61 ESP32_PINMUX(61, ESP_U1DSR_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART1_DTR
 * @{
 */
#define UART1_DTR_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_U1DTR_OUT)
#define UART1_DTR_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_U1DTR_OUT)
/** @} */

/**
 * @name UART1_RTS
 * @{
 */
#define UART1_RTS_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_U1RTS_OUT)
#define UART1_RTS_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_U1RTS_OUT)
/** @} */

/**
 * @name UART1_RX
 * @{
 */
#define UART1_RX_GPIO0 ESP32_PINMUX(0, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO1 ESP32_PINMUX(1, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO2 ESP32_PINMUX(2, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO3 ESP32_PINMUX(3, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO4 ESP32_PINMUX(4, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO5 ESP32_PINMUX(5, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO6 ESP32_PINMUX(6, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO7 ESP32_PINMUX(7, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO8 ESP32_PINMUX(8, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO9 ESP32_PINMUX(9, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO10 ESP32_PINMUX(10, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO11 ESP32_PINMUX(11, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO12 ESP32_PINMUX(12, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO13 ESP32_PINMUX(13, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO14 ESP32_PINMUX(14, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO15 ESP32_PINMUX(15, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO16 ESP32_PINMUX(16, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO17 ESP32_PINMUX(17, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO18 ESP32_PINMUX(18, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO19 ESP32_PINMUX(19, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO20 ESP32_PINMUX(20, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO21 ESP32_PINMUX(21, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO22 ESP32_PINMUX(22, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO23 ESP32_PINMUX(23, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO24 ESP32_PINMUX(24, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO25 ESP32_PINMUX(25, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO26 ESP32_PINMUX(26, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO27 ESP32_PINMUX(27, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO28 ESP32_PINMUX(28, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO30 ESP32_PINMUX(30, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO31 ESP32_PINMUX(31, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO32 ESP32_PINMUX(32, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO33 ESP32_PINMUX(33, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO34 ESP32_PINMUX(34, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO35 ESP32_PINMUX(35, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO36 ESP32_PINMUX(36, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO37 ESP32_PINMUX(37, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO38 ESP32_PINMUX(38, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO39 ESP32_PINMUX(39, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO40 ESP32_PINMUX(40, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO42 ESP32_PINMUX(42, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO43 ESP32_PINMUX(43, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO44 ESP32_PINMUX(44, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO45 ESP32_PINMUX(45, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO46 ESP32_PINMUX(46, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO47 ESP32_PINMUX(47, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO48 ESP32_PINMUX(48, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO49 ESP32_PINMUX(49, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO50 ESP32_PINMUX(50, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO51 ESP32_PINMUX(51, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO52 ESP32_PINMUX(52, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO53 ESP32_PINMUX(53, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO54 ESP32_PINMUX(54, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO55 ESP32_PINMUX(55, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO56 ESP32_PINMUX(56, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO57 ESP32_PINMUX(57, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO58 ESP32_PINMUX(58, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO59 ESP32_PINMUX(59, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO60 ESP32_PINMUX(60, ESP_U1RXD_IN, ESP_NOSIG)
#define UART1_RX_GPIO61 ESP32_PINMUX(61, ESP_U1RXD_IN, ESP_NOSIG)
/** @} */

