zephyrproject-rtos/zephyr/include/zephyr/dt-bindings/pinctrl/esp32s31-pinctrl.h
/**
 * @name UART3_RTS
 * @{
 */
#define UART3_RTS_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_U3RTS_OUT)
#define UART3_RTS_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_U3RTS_OUT)
/** @} */

/**
 * @name UART3_RX
 * @{
 */
#define UART3_RX_GPIO0 ESP32_PINMUX(0, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO1 ESP32_PINMUX(1, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO2 ESP32_PINMUX(2, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO3 ESP32_PINMUX(3, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO4 ESP32_PINMUX(4, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO5 ESP32_PINMUX(5, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO6 ESP32_PINMUX(6, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO7 ESP32_PINMUX(7, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO8 ESP32_PINMUX(8, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO9 ESP32_PINMUX(9, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO10 ESP32_PINMUX(10, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO11 ESP32_PINMUX(11, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO12 ESP32_PINMUX(12, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO13 ESP32_PINMUX(13, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO14 ESP32_PINMUX(14, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO15 ESP32_PINMUX(15, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO16 ESP32_PINMUX(16, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO17 ESP32_PINMUX(17, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO18 ESP32_PINMUX(18, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO19 ESP32_PINMUX(19, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO20 ESP32_PINMUX(20, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO21 ESP32_PINMUX(21, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO22 ESP32_PINMUX(22, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO23 ESP32_PINMUX(23, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO24 ESP32_PINMUX(24, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO25 ESP32_PINMUX(25, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO26 ESP32_PINMUX(26, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO27 ESP32_PINMUX(27, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO28 ESP32_PINMUX(28, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO30 ESP32_PINMUX(30, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO31 ESP32_PINMUX(31, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO32 ESP32_PINMUX(32, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO33 ESP32_PINMUX(33, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO34 ESP32_PINMUX(34, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO35 ESP32_PINMUX(35, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO36 ESP32_PINMUX(36, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO37 ESP32_PINMUX(37, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO38 ESP32_PINMUX(38, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO39 ESP32_PINMUX(39, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO40 ESP32_PINMUX(40, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO42 ESP32_PINMUX(42, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO43 ESP32_PINMUX(43, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO44 ESP32_PINMUX(44, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO45 ESP32_PINMUX(45, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO46 ESP32_PINMUX(46, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO47 ESP32_PINMUX(47, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO48 ESP32_PINMUX(48, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO49 ESP32_PINMUX(49, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO50 ESP32_PINMUX(50, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO51 ESP32_PINMUX(51, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO52 ESP32_PINMUX(52, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO53 ESP32_PINMUX(53, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO54 ESP32_PINMUX(54, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO55 ESP32_PINMUX(55, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO56 ESP32_PINMUX(56, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO57 ESP32_PINMUX(57, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO58 ESP32_PINMUX(58, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO59 ESP32_PINMUX(59, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO60 ESP32_PINMUX(60, ESP_U3RXD_IN, ESP_NOSIG)
#define UART3_RX_GPIO61 ESP32_PINMUX(61, ESP_U3RXD_IN, ESP_NOSIG)
/** @} */

/**
 * @name UART3_TX
 * @{
 */
#define UART3_TX_GPIO0 ESP32_PINMUX(0, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO1 ESP32_PINMUX(1, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO2 ESP32_PINMUX(2, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO3 ESP32_PINMUX(3, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO4 ESP32_PINMUX(4, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO5 ESP32_PINMUX(5, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO6 ESP32_PINMUX(6, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO7 ESP32_PINMUX(7, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO8 ESP32_PINMUX(8, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO9 ESP32_PINMUX(9, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO10 ESP32_PINMUX(10, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO11 ESP32_PINMUX(11, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO12 ESP32_PINMUX(12, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO13 ESP32_PINMUX(13, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO14 ESP32_PINMUX(14, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO15 ESP32_PINMUX(15, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO16 ESP32_PINMUX(16, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO17 ESP32_PINMUX(17, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO18 ESP32_PINMUX(18, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO19 ESP32_PINMUX(19, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO20 ESP32_PINMUX(20, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO21 ESP32_PINMUX(21, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO22 ESP32_PINMUX(22, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO23 ESP32_PINMUX(23, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO24 ESP32_PINMUX(24, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO25 ESP32_PINMUX(25, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO26 ESP32_PINMUX(26, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO27 ESP32_PINMUX(27, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO28 ESP32_PINMUX(28, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO30 ESP32_PINMUX(30, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO31 ESP32_PINMUX(31, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO32 ESP32_PINMUX(32, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO33 ESP32_PINMUX(33, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO34 ESP32_PINMUX(34, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO35 ESP32_PINMUX(35, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO36 ESP32_PINMUX(36, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO37 ESP32_PINMUX(37, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO38 ESP32_PINMUX(38, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO39 ESP32_PINMUX(39, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO40 ESP32_PINMUX(40, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO42 ESP32_PINMUX(42, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO43 ESP32_PINMUX(43, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO44 ESP32_PINMUX(44, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO45 ESP32_PINMUX(45, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO46 ESP32_PINMUX(46, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO47 ESP32_PINMUX(47, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO48 ESP32_PINMUX(48, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO49 ESP32_PINMUX(49, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO50 ESP32_PINMUX(50, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO51 ESP32_PINMUX(51, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO52 ESP32_PINMUX(52, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO53 ESP32_PINMUX(53, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO54 ESP32_PINMUX(54, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO55 ESP32_PINMUX(55, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO56 ESP32_PINMUX(56, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO57 ESP32_PINMUX(57, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO58 ESP32_PINMUX(58, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO59 ESP32_PINMUX(59, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO60 ESP32_PINMUX(60, ESP_NOSIG, ESP_U3TXD_OUT)
#define UART3_TX_GPIO61 ESP32_PINMUX(61, ESP_NOSIG, ESP_U3TXD_OUT)
/** @} */


/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DT_BINDINGS_PINCTRL_ESPRESSIF_ESP32S31_PINCTRL_H_ */
